{
  "backend/main.mo": "Motoko actor implementing user profile management, AI-driven task generation based on user capabilities and habits, daily quest generation system, and task completion tracking with experience and level progression.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: user profile setup questionnaire, automatic daily quest generation, voice control integration for AI quests, and dashboard display of personalization status.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, hooks, and configuration files including dashboard, profile setup, AI personalization, quest management, voice control, and game state management.",
  "frontend/index.css": "Tailwind CSS configuration with Solo Leveling-inspired dark theme using OKLCH color system, defining CSS custom properties for light and dark modes with blue/purple accent colors.",
  "frontend/index.html": "HTML entry point for the Life Leveling System application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring QueryClient for data fetching, ThemeProvider for dark mode, and rendering Dashboard with toast notifications.",
  "frontend/src/components/AchievementPanel.tsx": "Achievement display component showing unlocked/locked achievements in a grid with trophy icons, unlock status badges, completion percentage, and visual distinction between achieved and locked items.",
  "frontend/src/components/AIPersonalizationPanel.tsx": "Card component displaying AI personalization metrics including difficulty tier badge, progress to next tier, completion rate, streak counter, and quest statistics from QuestLog data.",
  "frontend/src/components/CharacterStats.tsx": "Displays character statistics including level, XP progress bar, and four core stats (Strength, Intelligence, Discipline, Agility) with icons and visual styling using Card components.",
  "frontend/src/components/DailyQuests.tsx": "Manages daily quests display and completion, integrating both local game state and backend AI-generated quests with support for multiple task types (exercise, nutrition, mindfulness, hydration, sleep) and text-to-speech feedback.",
  "frontend/src/components/DailyTaskList.tsx": "Provides UI for adding, completing, and deleting custom daily tasks with XP rewards, featuring a form input and task list with checkboxes and toast notifications.",
  "frontend/src/components/GoalTracker.tsx": "Tracks long-term goals with progress bars, allowing users to add goals with target values, increment progress, and receive XP rewards upon completion.",
  "frontend/src/components/HabitTracker.tsx": "Manages habit tracking with streak counting, enabling users to add habits, mark them complete daily, and earn XP for maintaining streaks.",
  "frontend/src/components/Layout.tsx": "Provides the main application layout with a sticky header showing the app title and logo, main content area, and footer with caffeine.ai attribution link.",
  "frontend/src/components/ProfileSetup.tsx": "Multi-step form component for setting up user health and fitness profile, including physical capabilities, health conditions, habits, and exercise preferences.",
  "frontend/src/components/ProfileSummary.tsx": "Displays a summary card of user's fitness profile including fitness level badge, health conditions, and preferred activities with an edit button.",
  "frontend/src/components/SkillProgression.tsx": "Component for managing skills with add/practice/delete functionality, progress tracking, level-up mechanics, and voice feedback integration.",
  "frontend/src/components/TaskManager.tsx": "Tabbed interface component that organizes and displays Daily Tasks, Habits, Skills, and Goals sections.",
  "frontend/src/components/VoiceControl.tsx": "Voice command interface with microphone button for starting/stopping voice recognition and displaying transcripts of spoken commands.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages Internet Identity authentication and creates/caches backend actor instances with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useDifficultyProgression.ts": "Hook that calculates difficulty tier, completion rate, streak, and progress metrics based on quest log data.",
  "frontend/src/hooks/useGameState.ts": "Core game state management hook handling character stats, tasks, habits, skills, goals, quests, and achievements with localStorage persistence and XP/leveling mechanics.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useProfile.ts": "Custom hook that manages user profile data, checks profile completeness based on required fields (capabilities, habits, preferences), and provides update functionality.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, quest logs, and tasks, with automatic cache invalidation on mutations.",
  "frontend/src/hooks/useQuestGeneration.ts": "Hook that monitors quest log freshness and determines if new daily quests need generation (after 24 hours or if empty), providing refetch capability.",
  "frontend/src/hooks/useTextToSpeech.ts": "Provides text-to-speech functionality using Web Speech API with specialized methods for announcing quest completions, difficulty increases, and quest lists.",
  "frontend/src/hooks/useVoiceRecognition.ts": "Implements voice command recognition using Web Speech API to process commands for adding/completing tasks, habits, skills, and AI quests through natural language.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for theming (colors, borders, spacing) supporting both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying character stats, tasks, quests, and achievements with profile setup flow, AI quest generation monitoring, and tab-based navigation.",
  "frontend/src/types/game.ts": "TypeScript type definitions for game entities including Character, DailyTask, Habit, Skill, Goal, Quest, and Achievement interfaces.",
  "frontend/src/types/speech.d.ts": "TypeScript type declarations for the Web Speech API, defining interfaces for SpeechRecognition, related events, results, and browser-specific implementations (including webkit prefix).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, glow shadows, accordion/pulse animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a Solo Leveling-inspired gamified life progression system with voice-activated task tracking, AI-powered personalized quest generation based on user physical capabilities, and XP/leveling mechanics."
}